//
//  LunarModel.m
//  JYCalendar
//
//  Created by 吴冬 on 15/11/4.
//  Copyright (c) 2015年 玄机天地. All rights reserved.
//

#import "LunarModel.h"

static LunarModel *modelForLunar = nil;

@implementation LunarModel

+ (LunarModel *)shareLunarModel
{
    static dispatch_once_t onceToken;
    dispatch_once(&onceToken, ^{
        
        if (modelForLunar == nil) {
            
            modelForLunar = [[LunarModel alloc] init];
            
        }
 
    });

    return modelForLunar;
}

+ (NSArray *)arrForLunarDay:(int )year
{
    NSDictionary *dicForLunar = @{
    @"2014年":@[@"29",@"30",@"29",@"30",@"29",@"30",@"29",@"30",@"30",@"29",@"30",@"29",@"30"],
    @"2015年":@[@"29",@"30",@"29",@"29",@"30",@"29",@"30",@"30",@"30",@"29",@"30",@"29"],
    @"2016年":@[@"30",@"29",@"30",@"29",@"29",@"30",@"29",@"30",@"30",@"29",@"30",@"30"],
    @"2017年":@[@"29",@"30",@"29",@"30",@"29",@"29",@"30",@"29",@"30",@"29",@"30",@"30",@"30"],
    @"2018年":@[@"29",@"30",@"29",@"30",@"29",@"29",@"30",@"29",@"30",@"29",@"30",@"30"],
    @"2019年":@[@"30",@"29",@"30",@"29",@"30",@"29",@"29",@"30",@"29",@"29",@"30",@"30"],
    @"2020年":@[@"29",@"30",@"30",@"30",@"29",@"30",@"29",@"29",@"29",@"29",@"30",@"29",@"30"],
    @"2021年":@[@"29",@"30",@"30",@"29",@"30",@"29",@"30",@"29",@"30",@"29",@"30",@"29"],
    @"2022年":@[@"30",@"29",@"30",@"29",@"30",@"30",@"29",@"30",@"29",@"30",@"29",@"30"],
    @"2023年":@[@"29",@"30",@"29",@"29",@"30",@"30",@"29",@"30",@"30",@"29",@"30",@"29",@"30"],
    @"2024年":@[@"29",@"30",@"29",@"29",@"30",@"29",@"30",@"30",@"29",@"30",@"30",@"29"],
    };

    NSString *strForKey = [NSString stringWithFormat:@"%d年",year];
    NSArray *arrForDayNumber = [dicForLunar objectForKey:strForKey];
    
    return arrForDayNumber;
}

+ (NSString *)strForLunarDay:(int )index
{
  
    NSArray *dayNameArray = @[@"初一", @"初二", @"初三", @"初四", @"初五", @"初六", @"初七", @"初八", @"初九", @"初十", @"十一", @"十二", @"十三", @"十四", @"十五", @"十六", @"十七", @"十八", @"十九", @"二十", @"廿一", @"廿二", @"廿三", @"廿四", @"廿五", @"廿六", @"廿七", @"廿八", @"廿九", @"三十", @"三一"];
    
    return dayNameArray[index];

}

+ (NSArray *)arrForLunarMonth:(int )year
{
    
    NSArray * Month2014 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"闰九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2015 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2016 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2017 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"闰六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2018 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2019 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2020 =
    @[@"正月",@"二月",@"三月",@"四月",@"闰四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2021 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2022 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2023 =
    @[@"正月",@"二月",@"闰二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];
    NSArray * Month2024 =
    @[@"正月",@"二月",@"三月",@"四月",@"五月",@"六月",@"七月",@"八月",@"九月",@"十月",@"冬月",@"腊月"];

    if (year == 2024) {
        
        return Month2024;
    }
    
    NSArray *arrForMonth = @[Month2014,Month2015,Month2016,Month2017,Month2018,Month2019,Month2020,Month2021,Month2022,Month2023,Month2024];
    NSArray *arrForReturn = nil;
    for (int i = 0; i < 10; i++) {
        
        if (year == 2014 + i) {
            
            
            arrForReturn = arrForMonth[i];
        }
        
    }

    return arrForReturn;
}


@end
